<b>1. Use the movies dataset and answer the questions:</b>

a. What is the average imdb score for movies?

b. How many null values are there in the ‘Age_certification’ column.

c. How many numeric valued columns are present?

d. Write the code to display the movies released after the year 2000. How many movies were released after the year 2000?

e. After dropping all the null values in the dataset, how many rows remain?

<b>Use the data after dropping the null values in 'imdb' and 'tmdb' columns to answer the below questions:</b>

f. Out of these rows, how many movies released after 2020?

g. What is the average tmdb_popularity for movies containing ‘Comedy’ as a genre?

h. In how many movie descriptions, the word ‘novel’ appears?

i. How many unique production countries are present in the data?

j. What is the average IMDB score for action movies?

In [55]:
import pandas as pd

In [56]:
data = pd.read_csv("movies.csv")

In [57]:
data.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts20945,The Three Stooges,SHOW,The Three Stooges were an American vaudeville ...,1934,TV-PG,19,"['comedy', 'family', 'animation', 'action', 'f...",['US'],26.0,tt0850645,8.6,1092.0,15.424,7.6
1,tm19248,The General,MOVIE,"During America’s Civil War, Union spies steal ...",1926,NaN,78,"['action', 'drama', 'war', 'western', 'comedy'...",['US'],NaN,tt0017925,8.2,89766.0,8.647,8.0
2,tm82253,The Best Years of Our Lives,MOVIE,It's the hope that sustains the spirit of ever...,1946,NaN,171,"['romance', 'war', 'drama']",['US'],NaN,tt0036868,8.1,63026.0,8.435,7.8
3,tm83884,His Girl Friday,MOVIE,"Hildy, the journalist former wife of newspaper...",1940,NaN,92,"['comedy', 'drama', 'romance']",['US'],NaN,tt0032599,7.8,57835.0,11.270,7.4
4,tm56584,In a Lonely Place,MOVIE,An aspiring actress begins to suspect that her...,1950,NaN,94,"['thriller', 'drama', 'romance']",['US'],NaN,tt0042593,7.9,30924.0,8.273,7.6

In [58]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9871 entries, 0 to 9870
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    9871 non-null   object
 1   title                 9871 non-null   object
 2   type                  9871 non-null   object
 3   description           9752 non-null   object
 4   release_year          9871 non-null   int64
 5   age_certification     3384 non-null   object
 6   runtime               9871 non-null   int64
 7   genres                9871 non-null   object
 8   production_countries  9871 non-null   object
 9   seasons               1357 non-null   float64
 10  imdb_id               9204 non-null   object
 11  imdb_score            8850 non-null   float64
 12  imdb_votes            8840 non-null   float64
 13  tmdb_popularity       9324 non-null   float64
 14  tmdb_score            7789 non-null   float64
dtypes: float64(5), int64(2), object(8)
memory usage: 1.1+ MB

In [59]:
print("Average IMDB Score: ", data['imdb_score'].mean())

Average IMDB Score:  5.97639548022599

In [60]:
null_vals = data["age_certification"].isnull().sum()
tot = len(data)

print("There are", tot - null_vals, "null values in Age Certification column.")

There are 3384 null values in Age Certification column.

In [61]:
data.dtypes

id                       object
title                    object
type                     object
description              object
release_year              int64
age_certification        object
runtime                   int64
genres                   object
production_countries     object
seasons                 float64
imdb_id                  object
imdb_score              float64
imdb_votes              float64
tmdb_popularity         float64
tmdb_score              float64
dtype: object

In [74]:
numeric = 0

for i in range(len(data.dtypes)):  
    if data.dtypes[i] in ['int64', 'float64']:
        numeric += 1

print("There are", numeric, "numeric columns.")

There are 7 numeric columns.

In [63]:
after_2000 = ((data['release_year'] > 2000) & (data['type'] == "MOVIE")).sum()

print(after_2000, "movies were released after the year 2000.")

5850 movies were released after the year 2000.

In [64]:
non_null = len(data.dropna())

print("After dropping the null values,", non_null, "rows remain.")

After dropping the null values, 581 rows remain.

In [65]:
# Pre-processing
data = data.dropna(subset=('imdb_id', 'imdb_score', 'imdb_votes', 'tmdb_popularity', 'tmdb_score'))



after_2020 = ((data['release_year'] > 2020) & (data['type'] == "MOVIE")).sum()

print(after_2020, "movies were released after the year 2020.")

390 movies were released after the year 2020.

In [66]:
total_tmdb_popularity = 0
count = 0

for i in range(len(data)):
    if ('comedy' in data.iloc[i, 7]) and (data.iloc[i][2] == "MOVIE"):
        total_tmdb_popularity += data.iloc[i, 13]
        count += 1
        
avg_tmdb_popularity = total_tmdb_popularity / count

print("Average tmdb_popularity for movies containing ‘Comedy’ as a genre is", avg_tmdb_popularity)

Average tmdb_popularity for movies containing ‘Comedy’ as a genre is 6.728305907284776

In [67]:
count = 0

for i in range(len(data)):
    if ('novel' in str(data.iloc[i, 3]).lower()) and (data.iloc[i][2] == "MOVIE"):
        total_tmdb_popularity += data.iloc[i, 13]
        count += 1

print("In", count, "movie descriptions, the word ‘novel’ appears.")

In 52 movie descriptions, the word ‘novel’ appears.

In [68]:
unique_countries = set()

for i in range(len(data)):
    for j in eval(data.iloc[i, 8]):
        unique_countries.add(j)

print(len(unique_countries), "unique production countries are present in the data.")

109 unique production countries are present in the data.

In [69]:
unique_countries

{'AE',
 'AF',
 'AL',
 'AN',
 'AR',
 'AT',
 'AU',
 'BA',
 'BE',
 'BG',
 'BM',
 'BO',
 'BR',
 'CA',
 'CH',
 'CI',
 'CL',
 'CM',
 'CN',
 'CO',
 'CR',
 'CU',
 'CY',
 'CZ',
 'DE',
 'DK',
 'DO',
 'EE',
 'EG',
 'ES',
 'ET',
 'FI',
 'FR',
 'GB',
 'GE',
 'GQ',
 'GR',
 'HK',
 'HR',
 'HU',
 'ID',
 'IE',
 'IL',
 'IN',
 'IO',
 'IR',
 'IS',
 'IT',
 'JM',
 'JO',
 'JP',
 'KE',
 'KH',
 'KR',
 'KZ',
 'LB',
 'LI',
 'LT',
 'LU',
 'LV',
 'MA',
 'MC',
 'MN',
 'MT',
 'MX',
 'MY',
 'NG',
 'NL',
 'NO',
 'NZ',
 'PA',
 'PH',
 'PK',
 'PL',
 'PR',
 'PS',
 'PT',
 'PY',
 'QA',
 'RO',
 'RS',
 'RU',
 'SE',
 'SG',
 'SI',
 'SK',
 'SO',
 'SU',
 'SV',
 'SY',
 'SZ',
 'TC',
 'TH',
 'TN',
 'TR',
 'TT',
 'TW',
 'UA',
 'UG',
 'US',
 'UY',
 'United States of America',
 'VE',
 'VN',
 'XC',
 'XK',
 'XX',
 'YU',
 'ZA'}

In [75]:
total_imdb_score = 0
count = 0

for i in range(len(data)):
    if ('action' in data.iloc[i, 7]) and (data.iloc[i][2] == "MOVIE"):
        total_imdb_score += data.iloc[i, 11]
        count += 1
        
avg_imdb_score = total_imdb_score / count


print("Average imdb_score for Action movies is", avg_imdb_score)

Average imdb_score for Action movies is 5.505442670537001

<b>2. Use the student_1 and student_2 excel files to answer the below question: Write the code for the following:<b>

a. Get columns 'Registration number' and 'Program' in student_1 which should come from student_2
    
b. Save this as a separate dataframe.
    
c. Create a column called 'attendance'. The column should contain the number of hours each student is present.

In [104]:
df1 = pd.read_excel("student_1.xlsx")
df2 = pd.read_excel("student_2.xlsx")

In [105]:
df1.head(3)

,num,11 Jul 2022,12 Jul 2022,13 Jul 2022,14 Jul 2022,19 Jul 2022,21 Jul 2022,26 Jul 2022
0,21110077,P,P,P,P,P,P,P
1,21110219,P,P,P,A,P,P,P
2,21110278,P,P,P,P,P,P,P

In [106]:
df2.head(3)

   roll_number         Program  Registration Number
0     21110072  B.Tech AI & DS          21011101001
1     21110024  B.Tech AI & DS          21011101002
2     21110136  B.Tech AI & DS          21011101003

In [107]:
df = df1.merge(df2, left_on="num", right_on="roll_number", how="inner")

In [108]:
df.head(3)

,num,11 Jul 2022,12 Jul 2022,13 Jul 2022,14 Jul 2022,19 Jul 2022,21 Jul 2022,26 Jul 2022,roll_number,Program,Registration Number
0,21110077,P,P,P,P,P,P,P,21110077,B.Tech CSE (IoT),21011102006
1,21110219,P,P,P,A,P,P,P,21110219,B.Tech CSE (IoT),21011102002
2,21110278,P,P,P,P,P,P,P,21110278,B.Tech CSE (IoT),21011102057

In [109]:
df['attendance'] = 0

for i in range(len(df)):
    for j in range(1, 8):
        if df.iloc[i, j] == 'P':
            df.loc[i, 'attendance'] += 1

In [110]:
df.head(3)

,num,11 Jul 2022,12 Jul 2022,13 Jul 2022,14 Jul 2022,19 Jul 2022,21 Jul 2022,26 Jul 2022,roll_number,Program,Registration Number,attendance
0,21110077,P,P,P,P,P,P,P,21110077,B.Tech CSE (IoT),21011102006,7
1,21110219,P,P,P,A,P,P,P,21110219,B.Tech CSE (IoT),21011102002,6
2,21110278,P,P,P,P,P,P,P,21110278,B.Tech CSE (IoT),21011102057,7